In [1]:
#here importing the pnadas and numpy library
import pandas as pd
import numpy as np

In [2]:
#reading the csv file
dataframe = pd.read_csv("House_Rent_Dataset-main.csv")

In [3]:
#printing the number of samples and attributes of dataset
print(dataframe.shape)

(4746, 12)

In [4]:
#printing the coiumns of data set
columns = list(dataframe.columns)
print(columns)

['Posted On', 'BHK', 'Rent', 'Size', 'Floor', 'Area Type', 'Area Locality', 'City', 'Furnishing Status', 'Tenant Preferred', 'Bathroom', 'Point of Contact']

In [5]:
#print the first 5 samples
print(dataframe.head())

    Posted On  BHK   Rent  Size            Floor Area Type  \
0  2022-05-18    2  10000  1100  Ground out of 2         1
1  2022-05-13    2  20000   800       1 out of 3         1
2  2022-05-16    2  17000  1000       1 out of 3         1
3  2022-07-04    2  10000   800       1 out of 2         1
4  2022-05-09    2   7500   850       1 out of 2         2

              Area Locality     City  Furnishing Status  Tenant Preferred  \
0                    Bandel  Kolkata                  1  Bachelors/Family
1  Phool Bagan, Kankurgachi  Kolkata                  2  Bachelors/Family
2   Salt Lake City Sector 2  Kolkata                  2  Bachelors/Family
3               Dumdum Park  Kolkata                  1  Bachelors/Family
4             South Dum Dum  Kolkata                  1         Bachelors

   Bathroom Point of Contact
0         2    Contact Owner
1         1    Contact Owner
2         1    Contact Owner
3         1    Contact Owner
4         1    Contact Owner

In [6]:
array = dataframe.values
print(array[1])

['2022-05-13' 2 20000 800 '1 out of 3' '1' 'Phool Bagan, Kankurgachi'
 'Kolkata' 2 'Bachelors/Family' 1 'Contact Owner']

In [7]:
#created a new dataframe
new_dataframe = dataframe
isnull = new_dataframe.isnull()
# print(isnull) #checking null value or not 
sum = new_dataframe.isnull().sum()
# print(sum)
mean = new_dataframe.isnull().mean()
# print(mean)
median = new_dataframe.isnull().median()
# print(median)
print(new_dataframe.shape)

(4746, 12)

In [8]:
#finding duplicate in dataset
duplicate = new_dataframe.duplicated()
# print(duplicate)
# finding dupicate oin particular column
rent = new_dataframe.Rent.duplicated()
print(rent)
print(new_dataframe.Size.duplicated())
# finding any duplicate value present in dataset --> it will return false is there is no duplicate value
print(new_dataframe.duplicated().any())

0       False
1       False
2       False
3        True
4       False
        ...
4741     True
4742     True
4743     True
4744     True
4745     True
Name: Rent, Length: 4746, dtype: bool
0       False
1       False
2       False
3        True
4       False
        ...
4741     True
4742     True
4743     True
4744     True
4745     True
Name: Size, Length: 4746, dtype: bool
False

In [9]:
# printing datatype of column
dttypes = new_dataframe.dtypes
print(dttypes);

Posted On            object
BHK                   int64
Rent                  int64
Size                  int64
Floor                object
Area Type            object
Area Locality        object
City                 object
Furnishing Status     int64
Tenant Preferred     object
Bathroom              int64
Point of Contact     object
dtype: object

In [10]:
# changing the attributes of dataset for training prupose
new_dataframe.replace({"Super Area" : "1" , "Carpet Area": "2"},inplace = True)
print(new_dataframe.shape)
print(new_dataframe.head())

(4746, 12)
    Posted On  BHK   Rent  Size            Floor Area Type  \
0  2022-05-18    2  10000  1100  Ground out of 2         1
1  2022-05-13    2  20000   800       1 out of 3         1
2  2022-05-16    2  17000  1000       1 out of 3         1
3  2022-07-04    2  10000   800       1 out of 2         1
4  2022-05-09    2   7500   850       1 out of 2         2

              Area Locality     City  Furnishing Status  Tenant Preferred  \
0                    Bandel  Kolkata                  1  Bachelors/Family
1  Phool Bagan, Kankurgachi  Kolkata                  2  Bachelors/Family
2   Salt Lake City Sector 2  Kolkata                  2  Bachelors/Family
3               Dumdum Park  Kolkata                  1  Bachelors/Family
4             South Dum Dum  Kolkata                  1         Bachelors

   Bathroom Point of Contact
0         2    Contact Owner
1         1    Contact Owner
2         1    Contact Owner
3         1    Contact Owner
4         1    Contact Owner

In [11]:
# replacing the Furninshing status
new_dataframe.replace({"Unfurnished" : "1" , "Furnished": "2" , "Semi-Furnished" : "2"},inplace = True)
print(new_dataframe.shape)
print(new_dataframe.head())

(4746, 12)
    Posted On  BHK   Rent  Size            Floor Area Type  \
0  2022-05-18    2  10000  1100  Ground out of 2         1
1  2022-05-13    2  20000   800       1 out of 3         1
2  2022-05-16    2  17000  1000       1 out of 3         1
3  2022-07-04    2  10000   800       1 out of 2         1
4  2022-05-09    2   7500   850       1 out of 2         2

              Area Locality     City  Furnishing Status  Tenant Preferred  \
0                    Bandel  Kolkata                  1  Bachelors/Family
1  Phool Bagan, Kankurgachi  Kolkata                  2  Bachelors/Family
2   Salt Lake City Sector 2  Kolkata                  2  Bachelors/Family
3               Dumdum Park  Kolkata                  1  Bachelors/Family
4             South Dum Dum  Kolkata                  1         Bachelors

   Bathroom Point of Contact
0         2    Contact Owner
1         1    Contact Owner
2         1    Contact Owner
3         1    Contact Owner
4         1    Contact Owner

In [12]:
new_dataframe.drop(['Point of Contact'], axis=1)

,Posted On,BHK,Rent,Size,Floor,Area Type,Area Locality,City,Furnishing Status,Tenant Preferred,Bathroom
0,2022-05-18,2,10000,1100,Ground out of 2,1,Bandel,Kolkata,1,Bachelors/Family,2
1,2022-05-13,2,20000,800,1 out of 3,1,"Phool Bagan, Kankurgachi",Kolkata,2,Bachelors/Family,1
2,2022-05-16,2,17000,1000,1 out of 3,1,Salt Lake City Sector 2,Kolkata,2,Bachelors/Family,1
3,2022-07-04,2,10000,800,1 out of 2,1,Dumdum Park,Kolkata,1,Bachelors/Family,1
4,2022-05-09,2,7500,850,1 out of 2,2,South Dum Dum,Kolkata,1,Bachelors,1
...,...,...,...,...,...,...,...,...,...,...,...
4741,2022-05-18,2,15000,1000,3 out of 5,2,Bandam Kommu,Hyderabad,2,Bachelors/Family,2
4742,2022-05-15,3,29000,2000,1 out of 4,1,"Manikonda, Hyderabad",Hyderabad,2,Bachelors/Family,3
4743,2022-07-10,3,35000,1750,3 out of 5,2,"Himayath Nagar, NH 7",Hyderabad,2,Bachelors/Family,3
4744,2022-07-06,3,45000,1500,23 out of 34,2,Gachibowli,Hyderabad,2,Family,2
4745,2022-05-04,2,15000,1000,4 out of 5,2,Suchitra Circle,Hyderabad,1,Bachelors,2